ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwm5.$name                                                   = "M_EPWM5";
epwm5.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm5.epwmCounterCompare_cmpA                                 = 250;
epwm5.epwmCounterCompare_cmpB                                 = 250;
epwm5.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm5.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm5.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm5.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm5.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm5.hrpwm_DBredHR                                           = 2;
epwm5.hrpwm_DBfedHR                                           = 2;
epwm5.epwmDeadband_enableRED                                  = true;
epwm5.epwmDeadband_redShadowMode                              = true;
epwm5.epwmDeadband_delayRED                                   = 20;
epwm5.epwmDeadband_enableFED                                  = true;
epwm5.epwmDeadband_fedShadowMode                              = true;
epwm5.epwmDeadband_delayFED                                   = 20;
epwm5.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm5.copyUse                                                 = true;
epwm5.epwmTimebase_period                                     = 500;
epwm5.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.copyFrom                                                = "M_EPWM2";
epwm5.epwm.$assign                                            = "EPWM5";
epwm5.epwm.epwm_aPin.$assign                                  = "GPIO8";
epwm5.epwm.epwm_bPin.$assign                                  = "GPIO9";

epwm6.$name                                                   = "M_EPWM6";
epwm6.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm6.epwmCounterCompare_cmpA                                 = 250;
epwm6.epwmCounterCompare_cmpB                                 = 250;
epwm6.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm6.hrpwm_DBredHR                                           = 2;
epwm6.hrpwm_DBfedHR                                           = 2;
epwm6.epwmDeadband_enableRED                                  = true;
epwm6.epwmDeadband_redShadowMode                              = true;
epwm6.epwmDeadband_delayRED                                   = 20;
epwm6.epwmDeadband_enableFED                                  = true;
epwm6.epwmDeadband_fedShadowMode                              = true;
epwm6.epwmDeadband_delayFED                                   = 20;
epwm6.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm6.copyUse                                                 = true;
epwm6.epwmTimebase_period                                     = 500;
epwm6.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.copyFrom                                                = "M_EPWM2";
epwm6.epwm.$assign                                            = "EPWM6";
epwm6.epwm.epwm_aPin.$assign                                  = "GPIO10";
epwm6.epwm.epwm_bPin.$assign                                  = "GPIO11";

epwm7.$name                                                   = "M_EPWM7";
epwm7.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm7.epwmCounterCompare_cmpA                                 = 250;
epwm7.epwmCounterCompare_cmpB                                 = 250;
epwm7.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm7.hrpwm_DBredHR                                           = 2;
epwm7.hrpwm_DBfedHR                                           = 2;
epwm7.epwmDeadband_enableRED                                  = true;
epwm7.epwmDeadband_redShadowMode                              = true;
epwm7.epwmDeadband_delayRED                                   = 20;
epwm7.epwmDeadband_enableFED                                  = true;
epwm7.epwmDeadband_fedShadowMode                              = true;
epwm7.epwmDeadband_delayFED                                   = 20;
epwm7.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm7.copyUse                                                 = true;
epwm7.epwmTimebase_period                                     = 500;
epwm7.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm7.copyFrom                                                = "M_EPWM2";
epwm7.epwm.$assign                                            = "EPWM7";
epwm7.epwm.epwm_aPin.$assign                                  = "GPIO12";
epwm7.epwm.epwm_bPin.$assign                                  = "GPIO13";

