ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwm8.$name                                                   = "M_EPWM8";
epwm8.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmCounterCompare_cmpA                                 = 250;
epwm8.epwmCounterCompare_cmpB                                 = 250;
epwm8.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm8.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm8.hrpwm_DBredHR                                           = 2;
epwm8.hrpwm_DBfedHR                                           = 2;
epwm8.epwmDeadband_enableRED                                  = true;
epwm8.epwmDeadband_redShadowMode                              = true;
epwm8.epwmDeadband_delayRED                                   = 20;
epwm8.epwmDeadband_enableFED                                  = true;
epwm8.epwmDeadband_fedShadowMode                              = true;
epwm8.epwmDeadband_delayFED                                   = 20;
epwm8.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm8.copyUse                                                 = true;
epwm8.epwmTimebase_period                                     = 500;
epwm8.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm8.copyFrom                                                = "M_EPWM2";
epwm8.epwm.$assign                                            = "EPWM8";
epwm8.epwm.epwm_aPin.$assign                                  = "GPIO14";
epwm8.epwm.epwm_bPin.$assign                                  = "GPIO15";

gpio1.$name                      = "FAULT_INPUT1";
gpio1.padConfig                  = "PULLUP";
gpio1.useInterrupt               = true;
gpio1.xint.xintNum               = "GPIO_INT_XINT3";
gpio1.xint.intType               = "GPIO_INT_TYPE_RISING_EDGE";
gpio1.xint.enableInt             = true;
gpio1.xint.registerInterrupts    = true;
gpio1.xint.xInt.enableInterrupt  = true;
gpio1.xint.xInt.interruptHandler = "FAULT_INPUT1_ISR";

gpio2.$name                      = "FAULT_INPUT2";
gpio2.useInterrupt               = true;
gpio2.gpioPin.$assign            = "GPIO29";
gpio2.xint.xintNum               = "GPIO_INT_XINT4";
gpio2.xint.enableInt             = true;
gpio2.xint.registerInterrupts    = true;
gpio2.xint.xInt.interruptHandler = "FAULT_INPUT2_ISR";
gpio2.xint.xInt.enableInterrupt  = true;

gpio3.$name           = "FAULT_OUTPUT";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO31";

gpio4.$name           = "DEBUG1";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO30";

gpio5.$name           = "ACTIVE1";
gpio5.gpioPin.$assign = "GPIO34";

gpio6.$name           = "ACTIVE2";
gpio6.gpioPin.$assign = "GPIO59";

gpio7.$name             = "STATUS1";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.initialValue      = 1;
gpio7.gpioPin.$assign   = "GPIO39";

gpio8.$name             = "STATUS2";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.initialValue      = 1;
gpio8.gpioPin.$assign   = "GPIO40";

gpio9.$name                      = "PRIM_ZCD1";
gpio9.padConfig                  = "PULLUP";
gpio9.useInterrupt               = true;
gpio9.gpioPin.$assign            = "GPIO23_VSW";
gpio9.xint.intType               = "GPIO_INT_TYPE_BOTH_EDGES";
gpio9.xint.enableInt             = true;
gpio9.xint.registerInterrupts    = true;
gpio9.xint.xInt.interruptHandler = "PZCD1_ISR";
gpio9.xint.xInt.enableInterrupt  = true;

gpio10.$name           = "PRIM_ZCD2";
gpio10.gpioPin.$assign = "GPIO22_VFBSW";

gpio11.$name           = "DEBUG2";
gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.gpioPin.$assign = "GPIO58";

gpio12.$name                         = "FAN1";
gpio12.direction                     = "GPIO_DIR_MODE_OUT";
gpio12.gpioPin.$assignAllowConflicts = "GPIO37/TDO";

gpio13.$name           = "FAN2";
gpio13.direction       = "GPIO_DIR_MODE_OUT";
gpio13.gpioPin.$assign = "GPIO35/TDI";

gpio14.$name           = "SEC_ZCD1";
gpio14.gpioPin.$assign = "GPIO33";

gpio15.$name           = "SEC_ZCD2";
gpio15.gpioPin.$assign = "GPIO17";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio9.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO23";

inputxbar_input2.$name         = "myINPUTXBARINPUT1";
gpio1.xint.inputxbar           = inputxbar_input2;
inputxbar_input2.inputxbarGpio = "GPIO28";

inputxbar_input3.$name         = "myINPUTXBARINPUT2";
gpio2.xint.inputxbar           = inputxbar_input3;
inputxbar_input3.inputxbarGpio = "GPIO29";

pmbus1.$name                        = "myPMBUS0";
pmbus1.pmbus.pmbus_alertPin.$assign = "GPIO27";
pmbus1.pmbus.pmbus_ctlPin.$assign   = "GPIO26";
pmbus1.pmbus.pmbus_sclPin.$assign   = "GPIO16";
pmbus1.pmbus.pmbus_sdaPin.$assign   = "GPIO25";

sci1.$name                 = "mySCI0";
sci1.sci.sci_rxPin.$assign = "GPIO57";
sci1.sci.sci_txPin.$assign = "GPIO56";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
gpio1.gpioPin.$suggestSolution        = "GPIO28";
pmbus1.pmbus.$suggestSolution         = "PMBUSA";
sci1.sci.$suggestSolution             = "SCIB";
